In [4]:
import numpy as np

# broadcasting

In [2]:
# row 1 col 1
x = np.array([[1,2,3]]) #1 row 3 col(1,3) 1 row to add
print(x.shape)

y = np.array([[4],[5]]) #2 row 1 col(2,1) 2 col to be added to make it equal
print(y.shape)

(1, 3)
(2, 1)

In [9]:
x,y = np.broadcast_arrays(x,y) #row isne 2 repeat kia 1 time ziada krdia 
x

array([[1, 2, 3],
       [1, 2, 3]])

In [10]:
y #col mei 3 krne k lie 2 times col add krdia

array([[4, 4, 4],
       [5, 5, 5]])

In [14]:
a = np.array([1,2,3],[2,2,2],[3,3,3])
b = np.array([[4],[5]])
a,b= np.broadcast_arrays(a,b)  # yahan ye conflict he row 1 4 ko repeat krun ya 5 ko. same in case of col

ValueError: only 2 non-keyword arguments accepted

# Pandas

In [17]:
#in numpy only numeric values but in pamdas  multi values
# 2 workhorse data  structures (how u arrange ur data)
# series n data frame

In [8]:
import pandas as pd

Pandas Data structures
Series 
Data frame 
########3series#########

In [20]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10]) # in output pandas creates indexing 0 to 9 here(0-9 is default index given by series object)
s1 # pandas series object

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [21]:
# in output pandas creates indexing 0 to 9 here(0-9 is default index given by series object)

In [22]:
s1[9] #accessing valus by index

10

In [23]:
s1[2,4,7,9,0] #error aega

KeyError: (2, 4, 7, 9, 0)

In [25]:
s1[[2,4,5,9,0]] #accessing multiple values #ye ail value leta he jo k list he here.but multiple values nhi lega
#that y we give in form of list but it will take as one value

2    33
4    55
5    66
9    10
0    11
dtype: int64

In [27]:
s1[5] =555 # replace value # modifying a value in s series
s1

0     11
1     22
2     33
3     44
4     55
5    555
6     77
7     88
8     99
9     10
dtype: int64

In [28]:
# to delete a value in series
del s1[5]

In [30]:
s1

0    11
1    22
2    33
3    44
4    55
6    77
7    88
8    99
9    10
dtype: int64

In [35]:
s1[[2,3,4]] = [2222,3333,4444]
s1

0      11
1      22
2    2222
3    3333
4    4444
6      77
7      88
8      99
9      10
dtype: int64

In [41]:
# insert ;if 99 index present then replace hojaegi value ;otherwise inserting
s1[99] = 999
s1

0       11
1       22
2     2222
3     3333
4     4444
6       77
7       88
8       99
9       10
99     999
dtype: int64

In [44]:
s1[0,1] = [222222,33333]
s1

0     222222
1      33333
2       2222
3       3333
4       4444
6         77
7         88
8         99
9         10
99       999
dtype: int64

In [45]:
# these index r basically key..so position not matters..call by key like dictionary

In [46]:
# multiple del n multiple insert nhi hoga

In [52]:
s2= pd.Series([10,20,30,40],index = ["orandes","apples","bananas","kiwi"])
s2

orandes    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [54]:
s2.index

Index(['orandes', 'apples', 'bananas', 'kiwi'], dtype='object')

In [55]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [60]:
ourindex = ["orandes","apples","bananas","kiwi"]
s2 = pd.Series([10,20,30,40], index = ourindex)
s2

orandes    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [61]:
#index name will not chagne. u can create new name n put values in that

In [62]:
s2>30

orandes    False
apples     False
bananas    False
kiwi        True
dtype: bool

In [63]:
s2[s2>30] #vakues greater then 30

kiwi    40
dtype: int64

In [64]:
s2[s2<30]

orandes    10
apples     20
dtype: int64

In [65]:
'peech' in s2 # checking if required key is in series or not

False

In [69]:
'kiwi' in s2

True

# Creating a series by using a dictionary

In [78]:
sdata = {'ohio': 35000,'Texas':71000,'Oregon':16000,'Utah':5000}
data = pd.Series(sdata)
data

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [73]:
#dic ko ro n col ki form mei bnai
# isne keys ko index bnadia
#use in fectching data in huge data

In [80]:
states = ['California','Ohio','Oregon','Texas']
data1 = pd.Series(sdata,index=states)
data1

California        NaN
Ohio              NaN
Oregon        16000.0
Texas         71000.0
dtype: float64

In [81]:
#jiski value nhi thi nan aega

In [82]:
data1['California']= 7800
data1

California     7800.0
Ohio              NaN
Oregon        16000.0
Texas         71000.0
dtype: float64

In [83]:
data1.isnull() #ihio ki value missing he

California    False
Ohio           True
Oregon        False
Texas         False
dtype: bool

In [84]:
data1.notnull()

California     True
Ohio          False
Oregon         True
Texas          True
dtype: bool

In [85]:
data1['Ohio'] =999999
data1

California      7800.0
Ohio          999999.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [86]:
data1.isnull() # none will be true

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

# Data Frames

In [90]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [92]:
data3 = {'studentsname':['Sidra','Fatima','Jaweria','hira'],
          'age':[28,22,21,18],
        'contactnumber': [123,456,789,1234],
        'adress':['gulshan','johar','johar','defence']}
                  
df3 = pd.DataFrame(data3)
                  
df3

  studentsname  age  contactnumber   adress
0        Sidra   28            123  gulshan
1       Fatima   22            456    johar
2      Jaweria   21            789    johar
3         hira   18           1234  defence

In [93]:
df3.shape

(4, 4)

In [94]:
type(df3)

pandas.core.frame.DataFrame

In [95]:
df1['pop'] # selecting single column bt col header

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [96]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [98]:
#to get two col
df1[['pop','year']] #selecting mulltiple col  by col header

   pop  year
0  1.5  2000
1  1.7  2001
2  3.6  2002
3  2.4  2001
4  2.9  2002
5  3.2  2003

In [99]:
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [100]:
del df1["pop"]

In [101]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [102]:
df1["debt"]=100
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   100
2    Ohio  2002   100
3  Nevada  2001   100
4  Nevada  2002   100
5  Nevada  2003   100

In [103]:
df1["debt"] =[10,20,30,40,50,60]
df1

    state  year  debt
0    Ohio  2000    10
1    Ohio  2001    20
2    Ohio  2002    30
3  Nevada  2001    40
4  Nevada  2002    50
5  Nevada  2003    60

In [105]:
df1["debt"] = df1['state']

In [106]:
df1

    state  year    debt
0    Ohio  2000    Ohio
1    Ohio  2001    Ohio
2    Ohio  2002    Ohio
3  Nevada  2001  Nevada
4  Nevada  2002  Nevada
5  Nevada  2003  Nevada

In [9]:
dic = {"AiforEO":[10,89,98,90,87,86,67,49],
      "Python1":[10,89,64,78,10,10,82,76],
      "python2":[59,75,10,95,76,95,65,78],
     }
df4 = pd.DataFrame(dic,index=["Nasir","Asad","Ramsha","Mansoor","Saba","Saba","Hina","Ali"])
df4

         AiforEO  Python1  python2
Nasir         10       10       59
Asad          89       89       75
Ramsha        98       64       10
Mansoor       90       78       95
Saba          87       10       76
Saba          86       10       95
Hina          67       82       65
Ali           49       76       78

In [160]:
# now to add total marks

df4['Total'] = df4['AiforEO']+df4['Python1']+df4['python2']
df4

         AiforEO  Python1  python2  Total
Nasir         10       10       59     79
Asad          89       89       75    253
Ramsha        98       64       10    172
Mansoor       90       78       95    263
Saba          87       10       76    173
Saba          86       10       95    191
Hina          67       82       65    214
Ali           49       76       78    203

In [162]:
#result fail n pass
df4['Check'] = df4['Total']<200
df4

         AiforEO  Python1  python2  Total  Check
Nasir         10       10       59     79   True
Asad          89       89       75    253  False
Ramsha        98       64       10    172   True
Mansoor       90       78       95    263  False
Saba          87       10       76    173   True
Saba          86       10       95    191   True
Hina          67       82       65    214  False
Ali           49       76       78    203  False

In [168]:
numbers=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
evenarr=[]
oddarr=[]
for num in numbers:
    if num%2 ==0:
        evenarr.append(num)
        
    else:
        oddarr.append(num)
        
print("even>>",evenarr)
print("odd>>",oddarr)

even>> [2, 4, 6, 8, 10, 12, 14]
odd>> [1, 3, 5, 7, 9, 11, 13, 15]

In [171]:
#list comprehension :list k andar rehte hue kam krte hen
[num for num in numbers if num%2==0]

[2, 4, 6, 8, 10, 12, 14]

In [173]:
df4['Check'] = ["Pass" if marks >=200 else "Fail" for marks in df4.Total ]
df4

         AiforEO  Python1  python2  Total Check
Nasir         10       10       59     79  Fail
Asad          89       89       75    253  Pass
Ramsha        98       64       10    172  Fail
Mansoor       90       78       95    263  Pass
Saba          87       10       76    173  Fail
Saba          86       10       95    191  Fail
Hina          67       82       65    214  Pass
Ali           49       76       78    203  Pass

In [178]:
df4['Percentage'] = df4['Total']/300 *100
df4

         AiforEO  Python1  python2  Total Check  Percentage
Nasir         10       10       59     79  Fail   26.333333
Asad          89       89       75    253  Pass   84.333333
Ramsha        98       64       10    172  Fail   57.333333
Mansoor       90       78       95    263  Pass   87.666667
Saba          87       10       76    173  Fail   57.666667
Saba          86       10       95    191  Fail   63.666667
Hina          67       82       65    214  Pass   71.333333
Ali           49       76       78    203  Pass   67.666667

In [6]:
#df kr k n dor same but ai for ao gap he tu dot woill not work
df4['Check'] = ["Pass" if a >=33 and p1 >= 33 and p2 >=33 else "Fail" 
                for a,p1,p2 in zip(df4['AiforEO'],df4["Python1"],df4["python2"])]
df4

NameError: name 'df4' is not defined

In [193]:
a = list(range(5))
b = list(range(6,11))
a

[0, 1, 2, 3, 4]

In [12]:
df4['Check'] = np.where((df4['AiforEO']<50) & (df4["Python1"]<50) & (df4["python2"]<50)) #np.where

ValueError: Length of values does not match length of index

In [181]:
b

[6, 7, 8, 9, 10]

In [182]:
c= zip(a,b)
for i in c:
    print(i)

(0, 6)
(1, 7)
(2, 8)
(3, 9)
(4, 10)

In [196]:
#for se we can extract 1 value but zip in for 3 values extract

In [197]:
#head return first 5 rows by default but u define then woi dega  when u hv many data
df4.head()

         AiforEO  Python1  python2  Total Check  Percentage
Nasir         10       10       59     79  Fail   26.333333
Asad          89       89       75    253  Pass   84.333333
Ramsha        98       64       10    172  Fail   57.333333
Mansoor       90       78       95    263  Pass   87.666667
Saba          87       10       76    173  Fail   57.666667

In [198]:
df4.head(3)

        AiforEO  Python1  python2  Total Check  Percentage
Nasir        10       10       59     79  Fail   26.333333
Asad         89       89       75    253  Pass   84.333333
Ramsha       98       64       10    172  Fail   57.333333

In [199]:
#tail last 5
df4.tail()

         AiforEO  Python1  python2  Total Check  Percentage
Mansoor       90       78       95    263  Pass   87.666667
Saba          87       10       76    173  Fail   57.666667
Saba          86       10       95    191  Fail   63.666667
Hina          67       82       65    214  Pass   71.333333
Ali           49       76       78    203  Pass   67.666667

In [200]:
df4.tail(2)

      AiforEO  Python1  python2  Total Check  Percentage
Hina       67       82       65    214  Pass   71.333333
Ali        49       76       78    203  Pass   67.666667

In [201]:
df4['Python1']

Nasir      10
Asad       89
Ramsha     64
Mansoor    78
Saba       10
Saba       10
Hina       82
Ali        76
Name: Python1, dtype: int64

In [202]:
df4['Mansoor'] # ye nhi hoga

KeyError: 'Mansoor'

In [203]:
df4.loc["Mansoor"] # gives details of that key # loc is location

AiforEO            90
Python1            78
python2            95
Total             263
Check            Pass
Percentage    87.6667
Name: Mansoor, dtype: object

In [208]:
df4.loc["Saba"]

      AiforEO  Python1  python2  Total Check  Percentage
Saba       87       10       76    173  Fail   57.666667
Saba       86       10       95    191  Fail   63.666667

In [209]:
#we can do slicing
df.loc["Nasir":"Hina"] # it includes hina also last one

         Ai for EO  Python1  python2
Nasir           78       90       95
Asad            89       89       75
Ramsha          98       64       85
Mansoor         90       78       95
Saba            87       98       76
Saba            86       95       95
Hina            67       82       65

In [210]:
df.iloc[0] #iloc is index location ;0 nhi tha tu by default pehla uthaya

Ai for EO    78
Python1      90
python2      95
Name: Nasir, dtype: int64

In [211]:
df.iloc[0:6] # iloc donot include last value but loc will include

         Ai for EO  Python1  python2
Nasir           78       90       95
Asad            89       89       75
Ramsha          98       64       85
Mansoor         90       78       95
Saba            87       98       76
Saba            86       95       95

In [214]:
df.iloc[1]

Ai for EO    89
Python1      89
python2      75
Name: Asad, dtype: int64

In [215]:
df.iloc[-1]

Ai for EO    89
Python1      76
python2      78
Name: Ali, dtype: int64

In [216]:
df.loc["Hina"::-1]

         Ai for EO  Python1  python2
Hina            67       82       65
Saba            86       95       95
Saba            87       98       76
Mansoor         90       78       95
Ramsha          98       64       85
Asad            89       89       75
Nasir           78       90       95

In [218]:
df.loc["Nasir":"Hina"]

         Ai for EO  Python1  python2
Nasir           78       90       95
Asad            89       89       75
Ramsha          98       64       85
Mansoor         90       78       95
Saba            87       98       76
Saba            86       95       95
Hina            67       82       65

In [219]:
df4.loc['Saba']['Python1']

Saba    10
Saba    10
Name: Python1, dtype: int64

In [221]:
# to add record  of one row
df4.loc['abc'] ='a'
df4

        AiforEO Python1 python2 Total Check Percentage
Nasir        10      10      59    79  Fail    26.3333
Asad         89      89      75   253  Pass    84.3333
Ramsha       98      64      10   172  Fail    57.3333
Mansoor      90      78      95   263  Pass    87.6667
Saba         87      10      76   173  Fail    57.6667
Saba         86      10      95   191  Fail    63.6667
Hina         67      82      65   214  Pass    71.3333
Ali          49      76      78   203  Pass    67.6667
abc           a       a       a     a     a          a

In [222]:
df4.loc['abc'] =[1,2,3,5,6,7]
df4

        AiforEO Python1 python2 Total Check Percentage
Nasir        10      10      59    79  Fail    26.3333
Asad         89      89      75   253  Pass    84.3333
Ramsha       98      64      10   172  Fail    57.3333
Mansoor      90      78      95   263  Pass    87.6667
Saba         87      10      76   173  Fail    57.6667
Saba         86      10      95   191  Fail    63.6667
Hina         67      82      65   214  Pass    71.3333
Ali          49      76      78   203  Pass    67.6667
abc           1       2       3     5     6          7

KeyError: 'check'